Autodesk.Revit.DB.Structure.BoundaryConditions.Point
If successful, returns the point represents Boundary Conditions.
Remarks:
Returns the point if the BoundaryConditions is BoundaryConditionsType::Point type. Otherwise exception is thrown.

Autodesk.Revit.DB.Structure.BoundaryConditions.associateWithLoad(Autodesk.Revit.DB.ElementId)
Sets the Autodesk::Revit::DB::ElementId^ of Load to associate.
elementToAssociateId: The Autodesk::Revit::DB::ElementId^ of Load to associate.
Returns: If the Autodesk::Revit::DB::ElementId^ was set returns true. Otherwise returns false.
Remarks: Autodesk::Revit::DB::ElementId^ may be set if the internal Load with the elementToAssociateId exist
and it's type fit the BoundaryConditions type only.

Autodesk.Revit.DB.Structure.BoundaryConditions.AssociatedLoad
Retrieve the AssociatedLoad.

Autodesk.Revit.DB.Structure.BoundaryConditions.Curve(System.Int32)
Returns the geometric curve within a geometric loop that defines the area.
curveIndex: The index curve in the BoundaryConditions.
Returns: If successful, returns the curve pointer. Otherwise returns null.
Remarks: The curve index should be between 0 and NumCurves-1.

Autodesk.Revit.DB.Structure.BoundaryConditions.NumCurves
Returns the number of curves represent the Boundary Conditions Element.
Remarks: For Point Boundary Conditions returns 0, for Line Boundary Conditions returns 1,
for Area Boundary Conditions returns value > 0.

Autodesk.Revit.DB.Structure.BoundaryConditions.HostElement
Retrieve the HostElementId.